[
  {
    "id": 0,
    "text": "Source: Dietary Advice For Individuals with Diabetes Andrew Reynolds, BSc, MSc, PhD, MPH and Joanna Mitri, MD, MS. CARBOHYDRATES The primary goal in the management of diabetes is to achieve as near normal regulation of blood glucose as possible. Both the type and total amount of carbohydrate (CHO) consumed influences glycemia. Car- bohydrate intake should emphasize nutrient-dense carbohydrate sources that are high in fiber (at least 14 g fiber per 1,000 kcal) and minimally processed (1). Dietary carbohydrate includes sugars, starch, and dietary fiber. Higher intakes of sugars are associated with weight gain and greater incidence of den- tal caries (5). Conversely, higher intakes of dietary fiber are associated with reduced non-communicable disease and premature mortality occurrence as well as improvements in body weight, cholesterol concentrations, and blood pressure (6, 7). These benefits with higher fiber intakes have been observed in the general population, for those with type 1, type 2, and pre diabetes, (8) and those with hypertension or heart disease (9). With this guidance in mind, eating plans should emphasize non-starchy vegetables, fruits, legumes, and whole grains, as well as dairy products with minimal added sugars (1, 10). There is less con- sistency of evidence for recommending an amount of overall CHO in the diet (1). This is in line with current World Health Organization for carbohydrate intakes for adults and children which stress the type of carbohydrate is impor- tant, with recommendations for fiber and vegetable and fruit intake, but no recommendations on CHO amount (7). Recent dietary guidelines for diabetes management from the European Association for the Study of Diabetes stress that a wide range of carbohydrate intakes can be appropriate, however both very high (>70%Total Energy (TE)) and low (<40%TE) intakes are associated with premature mortality (10). A recent comprehensive Cochrane systematic review of randomized",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 1,
    "text": "controlled trials (RCTs) of adults with overweight or obe- sity with or without type 2 diabetes concluded that there is probably little to no difference in weight reduction and changes in cardiovascular risk factors up to two years’ follow-up, when overweight and obese participants without and with T2DM are randomized to either low-carbohydrate or balanced-carbohydrate weight-reducing diets (11). Some of the reasons for these findings of a lack of effect with lower carbohydrate diets may be that: interventions do not consider the type of carbohydrate being consumed, with dietary fiber and sugar having differing physiological effects; the differing definitions of low CHO diets being applied; what CHO is replaced with; and that diets lower in CHO maybe diﬀicult to maintain in the long term as they are not consistent with the socio, cultural, and personal preference of many. Current ADA recommendations relating to CHO are: (1) Emphasize minimally processed, nutrient-dense, high-fiber sources of carbohy- drate (at least 14 g fiber per 1,000 kcal). People with diabetes and those at risk are advised to replace sugar-sweetened beverages (including fruit juices) with water or low-calorie or no-calorie beverages as much as possible to manage glycemia and reduce risk for cardiometabolic disease and minimize consump- tion of foods with added sugar that have the capacity to displace healthier, more nutrient-dense food choices. Provide education on the glycemic impact of carbohydrate, fat, and protein tailored to an individual’s needs, insulin plan, and preferences to optimize mealtime insulin dosing. When using fixed insulin doses, individuals should be provided with education about consistent patterns of carbohydrate intake with respect to time and amount while considering the insulin action time, as it can result in improved glycemia and reduce the risk for hypoglycemia. Dietary Fiber Current recommendations from the American Diabetes Association are that adults with diabetes",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 2,
    "text": "should consume high fiber foods (at least 14g fiber per 1,000 kcal) (1). Current recommendations from the European Association for the Study of Diabetes are that adults with dia- betes should consume at least 35g dietary fiber per day (or 16.7g per 1,000 kcal) (10). These two values are aligned, and higher than current World Health Or- ganization recommendations for the general population of at least 25g dietary fiber per day, (7) although all three recommendations recognize a minimum intake level, with greater benefits observed with higher intakes. These values are appreciably higher than current dietary fiber intakes in the United States, which is approximately 16g per day. Our understanding of the importance of dietary fiber has changed in recent years. Dietary fiber is carbohydrate that is not digested by the stomach or absorbed in the GI tract. Instead, it is either degraded in the colon by the gut microbiota, or passes through the human body intact. Higher intakes of dietary fiber are associated with lower all-cause mor- tality, heart disease, T2 diabetes incidence, and certain cancers such colorectal cancer when compared with lower fiber intakes (6). The benefits for childhood intakes of dietary fiber and health outcomes later in life remain uncertain (12). There are several established physiological pathways that might explain these associations, such as reducing postprandial glycemia, competitive inhibition of saturated fat in the small intestine, and greater satiety leading to reduce subse- quent intake. There are also more novel pathways proposed, such as modulation of the gut microbiota to increase branched and short chain fatty acids. Current recommendations by the World Health Organization are to obtain “naturally occurring dietary fiber as consumed in food” (7). Fiber supplements however are used frequently as additional dietary fiber sources, and may help individuals reach their fiber recommendations when suﬀicient",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 3,
    "text": "amounts cannot be obtained from food alone. Fiber supplements can be extracted fiber (taken from a plant source) or synthetic. Few fiber supplements have been studied for physiological effectiveness to the same degree as inherent dietary fiber, so current best ad- vice is to consume foods that are high in fiber (1, 7, 13). Recommended food sources of dietary fiber are minimally processed whole grains, vegetables, whole fruit and legumes (1, 7). An emphasis on minimally processed is made, as pro- cessing may reduce the benefits associated with intakes of these foods, (14-16) as well as introduce added nutrients such as saturated fats, sodium, and added sugars. The website below contains links to a comprehensive table listing fiber content of foods, and a calculator to help select foods with higher fiber content to help reach daily fiber goals. http://www.webmd.com/diet/healthtool-fiber-meter. In the Endotext chapter entitled “The Effect of Diet on Cardiovascular Disease and Lipid and Lipopro- tein Levels” in the Lipid and Lipoprotein section provides several tables provid- ing information on the fiber content of various foods. Starch Starch comprises most of the carbohydrates consumed globally, and is the storage carbohydrate found in refined cereals, potatoes, legumes, and bananas (16). Starch comprises two polymers: amylose (DP ~ 103) and amylopectin (DP ~ 104–105). Most cereal starches comprise 15–30% amylose and 70–85% amylopectin. In their raw form, most starches are resistant to digestion by pancreatic amylase, but gelatinize in heat and water, permitting rapid digestion (16). Dietary starch intake is rarely directly reported, so the health effects of dietary starch intake are often assessed through key sources, such as refined grains and potatoes. For potatoes, meta-analyses of prospective observational studies have identified the health effects are largely determined by the cooking method (17). Fried and salted potatoes were associated with higher incidence",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 4,
    "text": "of type 2 diabetes and hypertension. Boiled and roasted potatoes were not associated with increased or decreased risk to health (17). Some starches escape digestion, either naturally or due to food processing; these starches are called resistant starches. Resistant Starches Resistant starches are starch enclosed within intact cell walls. These include some legumes, starch granules in raw potato, retrograde amylose from plants modified to increase amylose content, or high-amylose containing foods, such as specially formulated cornstarch, which are not digested and ab- sorbed as glucose. Resistant starches avoid digestion in the small intestine so do not contribute to postprandial glycemia and diabetes risk, and are instead fermented in the colon by the microbiota. Sugars (Nutritive Sweeteners) Sucrose, also known as “table sugar,” is a disac- charide composed of one glucose and one fructose molecule and provides 4 kcals per gram (16). Available evidence from clinical studies does not indicate that the overall amount of dietary sucrose is related to type 2 diabetes incidence, however it is related to body weight gain and increased dental caries (5). Given the association between excess body weight and type 2 diabetes occurrence, (18) there is rationale to promote a reduction of sugar intake related to diabetes oc- currence, and replace sugar-sweetened beverages (including fruit juices) with water or no/low calorie beverages as much as possible (1). Fructose is a naturally occurring monosaccharide found in fruits, some vegeta- bles, and honey. High fructose corn syrup is used abundantly within the United States in processed foods as a less expensive alternative to sucrose. Fructose consumed in naturally occurring in foods such as fruit, (that also contain fiber) may result in better glycemic control compared with isocaloric intake of su- crose or fructose added to food, and is not likely to have detrimental effects on triglycerides as",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 5,
    "text": "long as intake is not excessive (<12% energy). A meta-analysis of 18 controlled feeding trials in people with diabetes compared the impact of fructose with other sources of carbohydrate on glycemic control. The analysis found that an isocaloric exchange of fructose for carbohydrates did not significantly affect fasting glucose or insulin and reduced glycated blood proteins in these trials of less than 12 weeks duration. The short duration is a potential limitation of the studies (19). Evidence exists that consuming high levels of fructose-containing beverages may have particularly adverse effects on selective deposition of ectopic and visceral fat, lipid metabolism, blood pressure, and insulin sensitivity compared with glucose-sweetened beverages (20). Thus, recommendations for dietary fructose tend to promote the reduction of fructose added to food, such as in fructose-containing beverages, while promoting whole fruit which can contain intrinsic fructose. Non-Nutritive Sweeteners Non-nutritive sweeteners provide insignificant amounts of energy and elicit a sweet sensation without increasing blood glucose or insulin concentrations. There are several FDA-approved sweeteners found to be safe when consumed within FDA acceptable daily intake amounts (ADI) (Table 1) (21). A review of 29 RCTs which included 741 people, 69 of which have type 2 diabetes, indicated that artificial sweeteners on their own do not raise blood glucose levels, but the content of the food or drink containing the artificial sweetener must be considered, especially for those with diabetes (22). This sentiment was echoed in recent WHO guidance on non-nutritive sweeteners for the general population (23) where their use was not recommended for weight loss, as the overall content of the processed food or drink was important. Practical Tips For Carbohydrate Intake Base meals and snacks around high fiber foods, such as whole grains, vegetables, whole fruit, and legumes. Com- mon whole grains include whole wheat, whole oats, brown",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 6,
    "text": "rice, barley, and quinoa. When purchasing wholegrain foods, check the label to make sure that the wholegrain is the first ingredient listed, and that energy from sugars is <10%. Consume fruit, but chose whole fruit over dried, juiced, or further pro- cessed fruit. Legumes are an excellent and cheap source of fiber and protein. Replace ground meat in meals such as casserole with lentils or legumes. Strive to include a variety of vegetables in your meals each day, avoiding deep fried and heavily salted options. FAT Evidence is inconclusive for an ideal amount of total fat intake for people with diabetes; therefore, goals should be individualized. In line with advice for the general public, people with diabetes should look to replace saturated and trans fats in the diet with mono and poly unsaturated fats (24). This is principally to lessen the increased risk of cardiovascular disease with high saturated and trans-fat intakes. Recent meta-analyses have found that decreasing the amount of saturated fatty acids and trans fatty acids, the principal dietary fatty acids linked to elevating LDL cholesterol, reduces the risk of CVD (25). The World Health Organization and American College of Cardiology currently recommend limiting the amount of dietary saturated and trans-fat intake (24, 26). Recommendations from the Institute of Medicine and the Academy of Nutrition and Dietetics for healthy individuals are that 20% to 35% of total energy should come from fat (27). Recommendations to reduce total fat intake are largely due to the high energy content of dietary fats, more so than protein or carbohydrate, and the risks associated with higher saturated fat intakes. Current recommendations for fat intakes from the American Diabetes Association focus on fat quality and its sources rather than quantity (1). They recommend: Counsel people with diabetes to consider an eating plan emphasizing",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 7,
    "text": "elements of a Mediterranean eating pattern, which is rich in monounsaturated and polyun- saturated fats and long-chain fatty acids such as fatty fish, nuts, and seeds, to reduce cardiovascular disease risk and improve glucose metabolism. The Amer- ican Heart Association has developed the Fat Facts to help individuals learn more about healthy vs. unhealthy fats. Among the campaign’s top priorities is to encourage replacing high trans-fat partially hydrogenated vegetable oils, animal fats, and tropical oils with healthier oils and foods higher in unsaturated fats — monounsaturated and polyunsaturated. See more at: https://www.heart.org/en/healthy-living/healthy-eating/eat- smart/fats/the-facts-on-fats. Monounsaturated Fatty Acids Monounsaturated fats (MUFA) are in foods such as avocado, some fish, nuts, and nut butters. MUFA are also found in vegetable oils such as olive, peanut, avocado, and canola oil. Several large prospective observational studies have documented that diets rich in MUFA or PUFA and lower in saturated fat are associated with a reduced risk of CVD (28). Meta- analysis of RCTs comparing diets higher in MUFA vs CHO or PUFA demon- strated that high MUFA containing diets can improve metabolic parameters and reduce cardiovascular disease risk in people with T2D (29, 30). Polyunsaturated Fatty Acids Polyunsaturated fats (PUFAs) are found in foods such as walnuts, sunflower seeds, and some fish such as salmon, mackerel, her- ring, and trout. PUFA are also found in vegetable oils such as corn oil, safflower oil, and soybean oil. Both PUFA and MUFA are usually liquid at room temper- ature. A meta-analysis of feeding trials has indicated consistent positive effects when other macronutrients, such as saturated fats, are replaced with PUFA on glycemia, insulin resistance, and insulin secretion capacity (31). Substitution data from prospective observational studies also indicates that replacing satu- rated and trans fats with PUFA reduces all-cause mortality and coronary heart disease, (25) with a smaller",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 8,
    "text": "body of evidence in those with diabetes indicating similar improvements in cardiovascular disease risk (30). A few specific types of PUFA are referred to as Omega-3 fats. These are called eicosapentaenoic acid (EPA), docosahexaenoic acid (DHA), and alpha-linolenic acid (ALA). These fats are particularly singled out and recommended to prevent or treat CVD; however, evidence does not support a beneficial role for the routine use of n-3 dietary supplements in diabetes management (1) or for the general population. EPA and DHA are found in fatty fish. ALA is found in nuts and seeds. Studies on the effect of omega-3 fatty acids (both from food and supplements) in persons with diabetes are limited and have been inconclusive (20). In addition to providing EPA and DHA, regular fish consumption may help reduce triglycerides by replacing other foods higher in saturated and trans fats from the diet, such as fatty meats and full-fat dairy products. Preparing fish without frying or adding cream-based sauces is recommended. Fish with high amounts of EPA and DHA include salmon, albacore tuna, mackerel, sardines, herring, and lake trout. Nuts and seeds high in ALA include walnuts, flax seeds, chia seeds and soybeans (16). Saturated Fats Saturated fats are usually solid or almost solid at room temper- ature. All land animal fats, such as those in meat, poultry, and dairy prod- ucts, are predominantly saturated. Processed and fast foods also contain high amounts of saturated fats. Some vegetable oils also can be saturated, includ- ing palm, palm kernel, and coconut oils (16). Oil such as coconut and palm (sometimes referred to as tropical oils) are touted as healthful saturated fats since they are derived from plants, however this is not accurate (25). Current ADA recommendations are to limit all sources of saturated fats (1). The World Health Organization recommends",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 9,
    "text": "limited consumption of saturated fats to less than 10% of total energy intake, (24) which is far less than the current average intake. When cooking with oil, choose non-tropical vegetable oils such as canola, corn, olive, peanut, safflower, soybean, and sunflower oils (16). Few research studies have been undertaken to look at the difference between the amount of saturated fatty acids (SFA) in the diet and glycemic control and CVD risk in people with diabetes (30). The ADA recommends people with diabetes follow the guidelines for the general population (20). In general, saturated fats are discouraged because they increase LDL-cholesterol and total cholesterol concentrations (24). Diets high in saturated fats have been implicated in an increased risk of cardiovascular disease. Three RCTs found that diets containing ￿7% SFA and ￿200 mg/day cholesterol reduced LDL cholesterol level from 9% to 12% compared to baseline values or to a more standard Western- type diet (32). As saturated fats are progressively decreased in the diet, they should be replaced with unsaturated fats and high fiber carbohydrates, and not with trans fats or refined carbohydrates (25). Trans Fats Trans fatty acids (TFA) are also called hydrogenated fats, which are fats created when oils are ”partially hydrogenated” (16). The process of hydrogenation changes the chemical structure of unsaturated fats by adding hydrogen atoms, or “saturating” the fat. Hydrogenation converts liquid oil into stick margarine or shortening. Manufacturers use hydrogenation to increase product stability and shelf-life. A large quantity of these fats can be produced at one time, saving manufacturing costs. Research trials indicate that TFA can increase LDL cholesterol and lower HDL cholesterol (33). Meta-analysis of prospective observational studies indicate higher intakes of trans fats are associated with higher cases of all-cause mortality, cardiovascular disease, and coronary heart disease (25). Although less prevalent by volume",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 10,
    "text": "in the food supply, trans fats appear at least as harmful to health as saturated fats (25). Due to the observations from both RCTs and prospective observational studies, the World Health Organization currently recommends that the total intake of trans fats be less than 1% of total energy intake (24). With the mandatory TFA labeling in the United States in 2006, a big push has been made by food manufacturers to remove TFA from processed and baked goods. Although the TFA content in foods has decreased recently (through food reformulation), it is important to monitor the type of fat used to replace TFA, as it might be saturated fat. The FDA has determined that trans fats are no longer considered generally recognized as safe (GRAS). While manufacturers cannot add TFAs to foods anymore, they may still be produced during the food manufacturing, so consumers should still check the nutrition information panel on foods. The main sources of trans fats in the food supply today are highly processed foods such as cakes, cookies, potato chips, and animal products. They can also be produced in the home when frying foods in fat at high temperatures. While most trans fats in the diet now are created during food manufacturing, smaller amounts of trans fats are also found in ruminant animals (cows and sheep). At present there is insuﬀicient evidence to indicate that the health effects differ between trans fats that are created in food manufacturing or ruminant derived, (25) so advice to reduce trans-fat intakes relates to total trans-fat (24). Cholesterol The body makes enough cholesterol for physiological functions, so it is not needed through foods. Older dietary guidelines formerly recommended avoiding or limiting consumption of foods high in cholesterol, in the idea that their intake would raise our own circulating cholesterol levels.",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 11,
    "text": "Now however, it is understood that saturated fat intake has a stronger influence on human cholesterol levels, so recommendations focus on reducing saturated fat as the priority (24). Stanols And Sterols Plant sterols are naturally occurring cholesterol derivatives from vegetable oils, nuts, corn, woods, and beans. Hydrogenation of sterols produces stanols. The generic term to describe both sterols, stanols, and their esters is phytosterols. An important role of phytosterols is their ability to block absorption of dietary and biliary cholesterol from the gastrointestinal tract. The LDL lowering property of both sterols and stanols is considered equivalent in short term studies (34). The amounts of sterols and stanol esters found natu- rally in a normal diet are insuﬀicient to have a therapeutic effect. Thus, many manufacturers add them to various foods for their LDL cholesterol lowering effects. You can find added phytosterols in margarine spreads, juices, yogurts, cereals, and even granola bars. Individuals with diabetes and dyslipidemia may be able to reduce total and LDL cholesterol by consuming at least 2 grams per day of plant stanols or sterols found in enriched foods (20). The evidence on long term use and in people with diabetes is less substantiated, as not many studies have been completed (35). Practical Tips On Fat Intake Fat intake should come primarily from good sources of mono and polyunsaturated fats: nuts and seeds, avocados, fish, and oils such as olive, canola, soybean, sunflower, and corn. Limit intake of saturated fats by cutting back on processed and fast foods, red meat, and full-fat dairy foods. Try replacing red meat with beans, nuts, skinless poultry, and fish whenever possible, and switching from whole milk and other full-fat dairy foods to lower fat versions. In place of butter or margarine, use liquid vegetable oils rich in polyunsaturated and monounsaturated fats",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 12,
    "text": "in cooking and at the table. Keep trans-fat intakes as low as possible. Check food labels for trans fats, and limit fried foods. PROTEIN Protein intake goals should be individualized based on an individual’s current eating patterns. The ADA Standards of Medical Care in Diabetes-2024 state that there is no evidence that adjusting the daily level of protein intake (typically1–1.5 g/kg body weight/day or 10–20% total energy) will improve health in individuals without diabetic kidney disease, and research is inconclusive regarding the ideal amount of dietary protein to optimize either glycemic control or cardiovascular disease (CVD) risk (1). Some research has found successful management of weight and type 2 diabetes with meal plans including slightly higher levels of protein (23–32% total energy) for periods up to one year for those without kidney disease (10). Those with diabetic kidney disease (with albuminuria and/or reduced estimated glomerular filtration rate) should aim to maintain dietary protein at the recommended daily allowance of no more than 0.8g/kg desirable body weight/day (or 10-15% total energy) (10). The National Kidney Foundation recommends 0.8 g protein/kg desirable body weight for people with diabetes and stages 1–4 chronic kidney disease as a means of reducing albuminuria and stabilizing kidney function (36). Reducing the amount of dietary protein below 10% total energy is not recommended as it places people at risk of protein inadequacy (10). The ADA recommends that in individuals with type 2 diabetes, ingested protein can increase insulin response without increasing plasma glucose concentrations. Therefore, carbohydrate sources high in protein should not be used to treat or prevent hypoglycemia (1). Further research is required to identify if the dietary source of protein (animal or plant) is important for health and diabetes. There is emerging evidence to suggest that plant sourced proteins may be superior for health, (1)",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 13,
    "text": "however it is not yet known if this is due to the amino acid compositions of the proteins or unadjusted effects from the accompanying nutri- ents, such as saturated fats in meat sources and dietary fiber in plant sources of protein. Replacement of red meat in the diet with plant-based protein sources (such as beans and legumes) appears to produce both health and environmental co-benefits, as well as being cheaper (37-39). Practical Tips For Protein Intake Ideal plant protein sources include legumes, lentils, tofu, and tempeh (1/2c = 2 oz protein). Plant-based meat alternatives maybe also be used (i.e. Quorn), but be wary of meat alternatives that have high sodium and saturated fat content. Nuts or seeds are another plant-based protein source to be encouraged, such as almonds, cashews, hazelnuts, filberts, Brazil nuts, macadamias, peanuts, pecans, walnuts, or sunflower, pumpkin seed or linseed. Nut butters are also a plant-based protein source but be mindful of added sodium and sugars. Good sources of lean animal protein include: skinless poultry, lower fat cuts of beef or pork, fish or egg, and reduced fat dairy products (i.e. low fat or skim milk/yogurt, and cheese). Protein sources should be a supplement to vegetables, fruits and whole grains for most meals, and not the entire meal. TARGET GUIDELINES FOR MICRONUTRIENTS There is no clear evidence that dietary supplementation with vitamins (such as Vitamin D), minerals (such as chromium), herbs, or spices (such as cinnamon or aloe vera) can improve outcomes in diabetes management where there are no underlying deficiencies. There is insuﬀicient evidence for dietary supplements to be recommended for the purposes of improving glycemic control (1). People with diabetes should be aware of the necessity for meeting vitamin and mineral needs from natural food sources through intake of a balanced diet. Spe- cific populations,",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 14,
    "text": "such as older adults, pregnant or lactating women, strict veg- etarians or vegans, and individuals on very low energy diets may benefit from a multivitamin mineral supplement (1). Excessive doses of certain vitamin or mineral supplements when there is no deficiency has been shown to be of no benefit and may even be harmful. There is some evidence that those on met- formin therapy are at higher risk of B12 deficiency and may need Vitamin B12 supplementation if tests indicate a deficiency (1, 40). VITAMINS Since type 2 diabetes is a state of increased oxidative stress, interest in recommending large doses of antioxidant vitamins has been high. Current studies demonstrate no benefit of carotene and Vitamins E and C in respect to improved glycemic control or treatment of complications. Routinely supple- menting the diet with antioxidant supplements is not recommended due to lack of evidence showing benefit in large, placebo-controlled clinical trials and con- cerns regarding potential long-term safety (1, 40). There is also not adequate evidence to recommend routine Vitamin D supplementation without deficiency (1, 41). MINERALS Sodium As for the general population, those with diabetes should limit sodium consumption to 2,300 mg/day (20, 42). Active steps to reduce current sodium intakes is necessary, as current intakes in the United States are around 3,400 mg/day, nearly 50% more than the recommended limit. The majority of sodium consumed is from processed foods. Food manufacturers and restaurants will need to provide additional reduced sodium alternatives to help accomplish consumption targets. For those with diabetes and hypertension, additional lifestyle modification beyond reducing sodium intake can be helpful, including: loss of excess body weight; increasing consumption of vegetables and fruit (8 –10 servings/day), and low-fat dairy products (2–3 servings/day); avoiding excessive alcohol consumption (no more than 2 servings/day in men and no more",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 15,
    "text": "than 1 serving/day in women); and increasing physical activity levels. These nonpharmacological strategies may also positively affect glycemia and lipid control (20). The DASH (Dietary Approaches to Stop Hypertension) diet, which is high in vegetables and fruit, low-fat dairy products, and low in saturated and total fat; has been shown in large, randomized, controlled trials to significantly reduce blood pressure (43). Magnesium Studies in support of magnesium supplementation to improve glycemic control are unclear and complicated by differences in study designs as well as baseline characteristics. There is some evidence from observational data that higher dietary intake of magnesium may help prevent type 2 diabetes in both middle aged men and women at higher risk for developing the disease (44). Additional long-term studies are needed to determine the best way to assess magnesium status and how magnesium deficiency impacts diabetes management, however dietary sources of magnesium include nuts, whole grains, and green leafy vegetables can be encouraged as part of a healthy dietary pattern. Chromium Several studies have demonstrated a potential role for chromium supplementation in the management of insulin resistance and type 2 diabetes. According to the ADA position statement, the findings with more significant effects were mainly found in poorer quality studies, limiting transferability of the results. Routine supplementation of chromium is therefore not recommended for treating diabetes or obesity (45). HERBAL SUPPLEMENTS There has been interest in the past several years on the effect of cinnamon, curcumin, and other herbs and spices in individuals with diabetes. The most recent ADA Lifestyle Management recommendations conclude that after a review of the evidence, there is not enough clear data to substantiate recommending the use of herbs or spices as treatment for T2D (1). The ADA also states that the use of any herbal supplements, which are not regulated and",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 16,
    "text": "vary in content, may provide more risk than benefit, in that herbs may interact with other medications that are taken to control diabetes (20). PROBIOTICS Probiotics (from pro and biota, meaning ”for life”), are certain kinds of “good” bacteria found in fermented foods, such as yogurt, kefir, and kimchi and are available as supplements. They are naturally found in the gut and may be depleted due to poor diet, use of antibiotics, smoking, etc. Pro- biotics have been studied extensively to improve gut flora for use in treatment and possibly prevention of various disorders, including irritable bowel syndrome, diarrhea, constipation, and genitourinary infections, to name a few. Different strains and amounts may work better for some conditions over others, but the FDA does not oversee the supplements, so content and effectiveness are not regulated. They are generally considered safe, as they are found naturally in the digestive tract. Some research has been done in people with gestational and type 2 diabetes us- ing probiotic supplements and foods to determine if chronic inflammatory and glycemic markers can be improved (46). The premise is that the microbiota may be connected to glucose metabolism by altering insulin sensitivity and in- flammation. At present there is insuﬀicient evidence to make recommendations for people with diabetes to take a probiotic for glycemic control. ALCOHOL Updated guidelines recommend there is no safe level of alcohol con- sumption (10). Adults with diabetes who chose to drink alcohol should do so in moderation (no more than one drink per day for adult women and no more than two drinks per day for adult men). Alcohol consumption may place people with diabetes at increased risk for hypoglycemia, especially if taking insulin or insulin secretagogues. Education and awareness regarding the recognition and management of delayed hypoglycemia due to alcohol with",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 17,
    "text": "or without a meal are warranted. Risks of excessive alcohol intake include hypoglycemia (partic- ularly for those using insulin or insulin secretagogue therapies), weight gain, and hyperglycemia (for those consuming excessive amounts). Hypoglycemia can occur through several mechanisms, including the inability of alcohol to be converted into glucose, the inhibitory effect of alcohol on gluconeogenesis, and its interference in normal counter regulatory hormonal responses to impend- ing hypoglycemia. To decrease the risk of alcohol induced hypoglycemia, it is best to have the alcohol with food. Consuming alcohol in a fasting state may contribute to hypoglycemia in people with type 1 diabetes. Symptoms of hy- poglycemia can be similar to drunkenness. When calculating the need for meal related boluses of insulin, one should account for the carbohydrate content of the alcohol if drinking sweet wines, liqueurs, or drinks made with regular juice or soda. PUTTING IT ALL TOGETHER- FOR TYPE 1 DIABETES AND THOSE ON INSULIN People taking insulin should be counseled on the importance of balancing food and beverage intake with timing and dosing of insulin. This is especially important for individuals with varied or hectic schedules such as shift workers, people that travel frequently, or anyone who has a schedule in which timing of meals and access to food is irregular (20). Numerous materials and resources are available that can be provided to people with diabetes to help them consider portion control, consistency in food intake and medication dosing, as well as planning to allow some flexibility in their daily self-care regimen (47). Ongoing support from a referral to medical nutrition therapy conducted by a registered dietitian (RD) or registered dietitian nutritionist (RDN), or a referral to a diabetes self- management education (DSMES) program that includes dietary advice is highly effective. The health care provider should provide individualized guidelines",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 18,
    "text": "for a target blood glucose range, considering safety and health. For motivated people, teaching an insulin to CHO ratio, and blood glucose correction factor may assist them with achieving blood glucose targets and achieving better glycemic control (1). CARBOHYDRATE COUNTING Carbohydrate counting is a tool that can be taught to the motivated, so that they can more easily estimate the amount (grams) of CHO in a particular food and adapt their insulin therapy accordingly (48). Furthermore, setting a target CHO intake for each meal allows those with diabetes to better match their CHO intake to the appropriate mealtime insulin dose. Potential advantages of CHO counting include improved glucose control, flexibility in food choices, a better understanding of how much insulin to take, and simplification of meal planning (49). Carbohydrate (CHO) intake affects acute blood glucose levels. Monitoring car- bohydrate, whether by carbohydrate counting, using the exchange method, or experienced- based estimation, remain an important strategy used in timing of medication administration and improving glycemic control (20). CHO count- ing methodology is based on the concept that each serving of CHO equals ap- proximately 15 grams of CHO. Generally, blood glucose response to digestible carbohydrate is similar, however carbohydrate sources naturally high in fiber including whole grains, legumes, vegetables, and whole fruits should be encour- aged over highly processed foods, fruit juices, and sweetened beverages. Insulin dosing also needs to be adjusted based on the protein and fat content of the mail as well, as high levels of either can slow down digestion and glucose uptake into circulation. On average woman require about 3-4 servings (45-60 grams), while men may need 4-5 servings (60-75 grams) of CHO at each meal (47). This num- ber could vary depending on individual energy needs (i.e., pregnant/nursing, ill, etc.), medication, and level of physical activity.",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 19,
    "text": "A good online resource for basic carbohydrate counting can be found on the UCSF website: https://dtc.ucsf.edu/living-with-diabetes/diet-and- nutrition/understanding- carbohydrates/counting- carbohydrates/ SPECIAL CONSIDERATIONS FOR THOSE WITH INTENSIVE INSULIN REGIMENS The following guidelines are the starting point for the nutritional component of intensified insulin management regimens for those not on closed loop systems: (1, 50) The initial diabetes meal plan should be based on the individual’s normal intake with respect to calories, food choices, and times of meals eaten. Choose an in- sulin regimen that is compatible with their normal pattern of meals, sleep, and physical activity. Synchronize insulin with meal times based on the action time of the insulin(s) used. Assess blood glucose levels prior to meals and snacks and at bedtime and adjust the insulin doses as needed based on intake. Monitor A1C, weight, lipids, blood pressure, and other clinical parameters, modifying the initial meal plan as necessary to meet goals. It is also important to educate those with diabetes on adjustment of prandial insulin considering premeal glu- cose levels, carbohydrate intake, and anticipated physical activity. For those with diabetes who are overweight and on insulin, counseling on nutrition, weight management, and monitoring blood glucose continues to be important compo- nents of treatment. Medical nutrition therapy is recommended with continued emphasis on making lifestyle changes to achieve a weight loss of 5% or more to reduce the risk of chronic complications associated with diabetes, CVD, and other risk factors that contribute to early mortality. Dietary recommendations can be illustrated by use of the Plate method. There are numerous resources for visuals and educational materials using the plate method and some are specific to diabetes. Half the plate should consist of veg- etables and fruit, while the other half is divided between whole grains and lean sources of protein. The dairy is",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 20,
    "text": "represented by a glass of nonfat or 1% milk or other nonfat or low-fat dairy source. The general guidelines for macronutrients are similar to that of the adult population with diabetes (1, 10). Mediterranean-Style Eating The Mediterranean-style eating pattern derived from the Mediterranean region of the world has been observed to improve glycemic control and cardiovascular disease risk factors. The Mediterranean eating pattern includes: Vegetables, fruits, nuts, seeds, legumes, potatoes, whole grains, breads, herbs, spices, fish, seafood and extra virgin olive oil. Emphasis is placed on use of minimally processed foods, seasonal fresh and locally grown foods. Olive oil is the primary fat, replacing other fats and oils (including butter and margarine). Fresh fruit as daily dessert; sweets only rarely. Low-to-moderate amounts of cheese and yogurt. Red meat limited to only 12 oz to 16 oz per month. DASH Eating Plan Dietary Approaches to Stop Hypertension (DASH) is a flexible and balanced eating plan that is based on research studies sponsored by the National Heart, Lung, and Blood Institute (NHLBI). The DASH diet empha- sizes vegetables, fruit, fat-free or low-fat dairy, whole grains, nuts and legumes, and limit the intake of total and saturated fat, cholesterol, red and processed meats, sweets and added sugars, including sugar-sweetened beverages. Results from RCTs indicate reductions in glycemia, blood pressure, body weight, and -cholesterol concentrations (73). In prospective cohort studies the DASH diet is associated with reductions in the risk of CVD, CHD and stroke (73). DASH is considerably lower in sodium than the typical American diet. Gluten Free Gluten is a protein commonly found in wheat, barley, rye, and other grains. A gluten free diet is essential to treat people with celiac disease. Celiac disease is an inflammatory condition in persons who are intolerant to gluten and suffer inflammatory and gastrointestinal side effects",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 21,
    "text": "when gluten is consumed, leading to damage of the small intestine. It is noted that approximately 10% of people with type 1 diabetes also have celiac disease, which is significantly higher than the general population (1-2%). There seems to be no connection with Celiac disease and type 2 diabetes (76). There is no evidence of health benefits when avoiding gluten for those without celiac disease. The gluten free diet has recently grown in popularity in persons who identify as gluten sensitive, but don’t have celiac disease. According to the ADA, people with T1D can follow a gluten free diet should they wish to, but it may provide additional challenges. Common CHO containing foods that do not contain gluten are: white and sweet potatoes, brown and wild rice, corn, buckwheat, soy, quinoa, sorghum, and legumes. These foods can be used in place of gluten containing grains. MAYO Clinic Diet Developed by the Mayo Clinic, a two-phase approach to lose and maintain body weight using the Mayo Clinic food pyramid. For more information see: https://diet.mayoclinic.org/diet/how-it-works. Jenny Craig® The plan emphasizes restricting energy, fat, and portions. Jenny’s prepackaged meals and recipes do all three, plus emphasize healthy eating, an active lifestyle, and behavior modification. Personal consultants guide members through their journeys from day one. You’ll gain support and motivation, and learn how much you should be eating, what a balanced meal looks like and how to use that knowledge once you graduate from the program. Jenny Craig offers two programs: its standard program and Jenny Craig for Type 2, which is designed for people with Type 2 diabetes by including a lower-carb menu, reinforcement of self-monitoring of blood glucose levels, consistent meals and snacks, and other self-management strategies for weight loss and support for di- abetes control. Because you buy foods, this program",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 22,
    "text": "can be more expensive, but convenient for some. For more information see: https://www.jennycraig.com/. Vegan Diet Veganism excludes all animal products from the diet – including dairy and eggs. Fruits, vegetables, leafy greens, whole grains, nuts, seeds and legumes are the staples. It is restrictive, but beneficial for the cardiovascular system. Source: Chapter 5 of ADA Standards of Care 2025 For diabetes prevention and management of people with prediabetes or diabetes, recommend individualized meal plans that keep nutrient quality, total calories, and metabolic goals in mind, B as data do not support a specific macronutrient pattern. Eating patterns should emphasize key nutrition principles (inclusion of nonstarchy vegetables, whole fruits, legumes, lean proteins, whole grains, nuts and seeds, and low-fat dairy or nondairy alternatives) and minimize consump- tion of red meat, sugar-sweetened beverages, sweets, refined grains, processed and ultraprocessed foods in people with prediabetes and diabetes. B Consider re- ducing overall carbohydrate intake for adults with diabetes to improve glycemia, as this approach may be applied to a variety of eating patterns that meet indi- vidual needs and preferences. B Health care professionals should inquire about intake of dietary supplements and counsel as necessary. Supplementation with micronutrients (e.g., vitamins and minerals, such as magnesium or chromium) or herbs or spices (e.g., cinnamon and aloe vera) for glycemic benefits is not recommended. C Counsel against b-carotene supplementation, as there is evidence of harm for certain individuals and it confers no benefit 0 Counsel people with diabetes to limit sodium consumption to <2,300 mg/day, as clinically appropriate, and that the best way to achieve this is through lim- iting consumption of processed foods. Counsel people with prediabetes and diabetes that water is recommended over nutritive and nonnutritive sweetened beverages. A Counsel people with diabetes and those at risk for diabetes that nonnutritive sweeteners can",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 23,
    "text": "be used instead of sugar-sweetened products if con- sumed in moderation and for the short term to reduce overall calorie and car- bohydrate intake. Carbohydrates Emphasize minimally processed, nutrient-dense, high-fiber sources of carbohydrate (at least 14 g fiber per 1,000 kcal). Advise people with diabetes and those at risk to replace sugar-sweetened beverages (including fruit juices) with water or low-calorie or no-calorie beverages as much as possible to manage glycemia and reduce risk for cardiometabolic disease and minimize consumption of foods with added sugar that have the capacity to displace healthier, more nutrient-dense food choices. Regardless of diabetes classifica- tion, individuals treated with sodium–glucose cotransporter 2 inhibitors should avoid a ketogenic eating pattern, be educated on the signs of ketoacidosis and methods of risk mitigation and provided with appropriate tools for accurate ketone measurement (i.e., serum b-hydroxybutyrate), and be instructed to avoid fasting and maintain appropriate insulin therapy. Provide education on the glycemic impact of carbohydrate, fat, and protein tailored to an individual’s needs, insulin plan, and preferences to optimize mealtime insulin dosing. When using fixed insulin doses, individuals should be provided with education about consistent patterns of carbohydrate intake with respect to time and amount while considering the insulin action time, as it can result in improved glycemia and reduce the risk for hypoglycemia Proteins People with diabetes and those at risk for diabetes are advised to incorporate more plant-based protein sources (e.g., nuts, seeds, and legumes) as part of an overall diverse eating pattern to reduce cardiovascular disease risk. Counsel people with diabetes to consider an eating plan emphasizing elements of a Mediterranean eating pattern, which is rich in monounsaturated and polyunsaturated fats and long-chain fatty acids such as fatty fish, nuts, and seeds, to reduce cardiovascular disease risk and improve glucose metabolism. Fats Counsel people with diabetes",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 24,
    "text": "and those at risk for diabetes to limit intake of foods high in saturated fat (e.g., red meat, full-fat dairy, butter, and coconut oil) to help reduce cardiovascular disease risk Nutriton behaviors to encourage Vegetables—especially nonstarchy vegetables that are dark green, red, and orange in color; fresh, frozen, or low-sodium canned are all acceptable vegetable options. Legumes—dried beans, peas, and lentils. Fruits—especially whole fruit—fresh, frozen, or canned in own juice (or no added sugar) are all acceptable fruit options. Whole-grain foods—where culturally appropriate, whole-grain versions of commonly consumed foods such as 100% whole-wheat breads or pastas, and brown rice. When not culturally appropriate, focus more on portion control. Foods with at least 3 g of fiber per serving, which generally indicates a food higher in fiber. Water should be the primary beverage of choice. For individuals who do not prefer plain water, no-calorie alternatives are the next best choice. Options include adding lemon, lime, or cucumber slices to water; sparkling no-calorie water or flavored no-calorie waters; no-calorie carbonated beverages, etc. Plant-based proteins can include legumes (e.g., soybeans, pinto beans, black beans, garbanzo beans, dried peas, and lentils), nuts, and seeds. Meats and poultry should be from fresh, frozen, or low-sodium canned and in lean forms (e.g., chicken breast and ground turkey). Heart-healthy wild-caught fatty fish such as salmon, tuna, sardines, and mackerel. Fresh, frozen, or low-sodium canned are all acceptable options. Use herbs (e.g., basil, fennel, mint, parsley, rosemary, and thyme) and spices (e.g., cinnamon, garam masala, ginger, pepper, and turmeric) to season foods instead of salt or salt-containing preparations. Incorporate onions, garlic, celery, carrots, and other vegetables as a base for preparing various homemade foods. Cook with vegetable oil (e.g., canola and olive) in place of fats high in saturated fat (e.g., butter, shortening, lard, and coconut oil). Meal",
    "source": "ada_guidelines.pdf"
  },
  {
    "id": 25,
    "text": "prep by planning out meals for the week, grocery shopping with a list, and cooking on a day off so there are ready-to-eat and readyto-reheat homemade meals waiting in the fridge or freezer. Include family or roommates in meal preparation; share the responsibilities of grocery shopping and cooking.",
    "source": "ada_guidelines.pdf"
  }
]